
# tap repositories and their packages

tap 'homebrew/core'
brew 'alsa-lib'
brew 'autoconf'
brew 'aws-iam-authenticator'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'binutils'
brew 'bison'
brew 'brotli'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cups'
brew 'curl'
brew 'expat'
brew 'fontconfig'
brew 'freetype'
brew 'fzf'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'go'
brew 'gperf'
brew 'graphite2'
brew 'guile'
brew 'harfbuzz'
brew 'helm'
brew 'icu4c'
brew 'isl'
brew 'jpeg-turbo'
brew 'k9s'
brew 'krb5'
brew 'krew'
brew 'kubernetes-cli'
brew 'lazydocker'
brew 'libedit'
brew 'libevent'
brew 'libffi'
brew 'libice'
brew 'libidn2'
brew 'libmpc'
brew 'libnghttp2'
brew 'libnsl'
brew 'libpng'
brew 'libpthread-stubs'
brew 'libsm'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtirpc'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxcrypt'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxi'
brew 'libxml2'
brew 'libxrandr'
brew 'libxrender'
brew 'libxt'
brew 'libxtst'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nerdctl'
brew 'nettle'
brew 'node'
brew 'openjdk'
brew 'openldap'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pcre2'
brew 'perl'
brew 'pixman'
brew 'pkg-config'
brew 'python@3.10'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rust'
brew 'sqlite'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'unzip'
brew 'util-linux'
brew 'xorgproto'
brew 'xz'
brew 'yadm'
brew 'zip'
brew 'zlib'
brew 'zoxide'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'geskunkworks/geskunkworks-taps'
brew 'gossamer3'

tap 'jesseduffield/lazydocker'

tap 'rcmdnk/file'
brew 'brew-file'
